akamud.vscode-theme-onelight
BazelBuild.vscode-bazel
CoenraadS.bracket-pair-colorizer-2
dbaeumer.vscode-eslint
deerawan.vscode-dash
denoland.vscode-deno
esbenp.prettier-vscode
humao.rest-client
James-Yu.latex-workshop
meganrogge.template-string-converter
mrkou47.thrift-syntax-support
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
msjsdiag.debugger-for-chrome
rust-lang.rust
streetsidesoftware.code-spell-checker
sysoev.vscode-open-in-github
waderyan.gitblame
zhuangtongfa.material-theme
