akamud.vscode-theme-onelight
alefragnani.Bookmarks
alefragnani.project-manager
BazelBuild.vscode-bazel
dbaeumer.vscode-eslint
deerawan.vscode-dash
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
James-Yu.latex-workshop
meganrogge.template-string-converter
mrkou47.thrift-syntax-support
ms-azuretools.vscode-docker
ms-python.python
ms-vscode-remote.remote-containers
msjsdiag.debugger-for-chrome
rust-lang.rust
streetsidesoftware.code-spell-checker
sysoev.vscode-open-in-github
zhuangtongfa.material-theme
