akamud.vscode-theme-onelight
BazelBuild.vscode-bazel
BriteSnow.vscode-toggle-quotes
dbaeumer.vscode-eslint
denoland.vscode-deno
esbenp.prettier-vscode
fabiospampinato.vscode-open-in-github
GitHub.remotehub
humao.rest-client
James-Yu.latex-workshop
meganrogge.template-string-converter
mrkou47.thrift-syntax-support
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
msjsdiag.vscode-react-native
rust-lang.rust
streetsidesoftware.code-spell-checker
waderyan.gitblame
zhuangtongfa.material-theme
