
######
# Homebrew
######

### Fonts
cask "font-fira-code"
cask "font-fira-sans"
cask "font-latin-modern"
cask "font-sf-mono"

### Qmk
brew "qmk/qmk/qmk"

### Shell
brew "bat"
brew "choose-rust"
brew "cloc"
brew "diff-so-fancy"
brew "duti"
brew "eza"
brew "fd"
brew "fish"
brew "jq"
brew "just"
brew "nano"
brew "nanorc"
brew "ripgrep"
brew "sd"
brew "tldr"
brew "trash"
brew "vim"
brew "wget"
brew "zsh"

### Source control
brew "bfg"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-sizer"
brew "jj"

### Swift dev tools
# brew "carthage"
# brew "cocoapods"
brew "swiftformat"
brew "vapor"

### Other dev tools
# brew "cmake"
# brew "deno"
# brew "docker"
# brew "node"
# brew "ruby"
brew "typst"
# brew "vsce"
# brew "yarn"

######
# Applications
######

### Utils
cask "alfred"
cask "1password"
cask "1password-cli"
cask "iina"
cask "itsycal"
cask "jordanbaird-ice"
cask "mac-mouse-fix"
cask "netnewswire"
cask "syntax-highlight"

### Coding
cask "dash"
cask "docker"
cask "fork"
cask "iterm2"
cask "markedit"
cask "sf-symbols"
cask "visual-studio-code"
cask "zed"

### Work tools
cask "gimp"
cask "google-chrome"
cask "slack"

### Other tools
cask "calibre"
cask "handbrake"
cask "keka"
cask "transmission"

### Games
cask "steam"
cask "minecraft"
cask "openemu"
cask "synthesia"
cask "battle-net"

######
# App store
######

brew "mas"

mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Core Data Lab", id: 1460684638
mas "CotEditor", id: 1024640650
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Free Ruler", id: 1483172210
mas "Things", id: 904280696
mas "Xcode", id: 497799835

######
# Vscode extensions
######

vscode "artlaman.chalice-icon-theme"
vscode "briteSnow.vscode-toggle-quotes"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "nvarner.typst-lsp"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "waderyan.gitblame"
